#coding=utf-8

name = 'laowang'
age = 18
address = 'guangdong'

#一次输出多个变量
print("你的名字叫%s，今年%d岁，住在%s"%(name,age,address))


###########################
'''
常用%格式符号                      转换
%c                  #       字符
%s                  #       通过str()字符窜转换来格式化
%i                  #       有符号十进制整数
%d                  #       有符号十进制整数
%u                  #       无符号十进制整数
%o                  #       八进制整数
%x                  #       十六进制整数（小写字母）
%X                  #       十六进制整数（大写字母）
%e                  #       索引符号（小写'e'）
%E                  #       索引符号（大写'E'）
%f                  #       浮点实数
%g                  #       %f和%e的简写
%G                  #       %f和%E的简写

'''
